import 'package:book/Colors.dart';
import 'package:book/test.dart';
import 'package:flutter/material.dart';

class story extends StatelessWidget {
  story({super.key});

  List image = [

    {
      'image': 'asset/hager).jpg',
      'i': 'هاجر ',
      'text': '''أصحاب رسول الله
هنتكلم النهارده عن صحابي جليل وهو (عمار بن ياسر) رضى الله عنه 🤍 عمار بن ياسر (الطيب المطيب)وهو رجل من أهل الجنة ،وُلد عمار بمكة المكرمة سنة570م،وكانوأبوه هو ياسر بن عامر،وأمه سمية بنت خياط،كان ياسر بن عامر والد عمار من اليمن ولكنه ترك وخرج منها ليبحث عن أخيه حتى استقر فى مكة وطاب له المقام بها محالفاً أبا حُذيفة بن المغيرة ،وبنو المغيرة كان لهم شأنٌ رفيع فى مكة،فقام أبو حذيفة بتزويج ياسر بن عامر إحدى إمائه وهى (سمية بنت خياط)ومن هذا الزواج المبارك رُزق الأبوين (عمَّاراً)رضى الله عنه 🤍''',
    },
    {
      'image': 'asset/hager).jpg',
      'i': 'هاجر ',
      'text': '''أصحاب رسول الله
هنتكلم النهارده عن صحابي جليل وهو (عمار بن ياسر) رضى الله عنه 🤍 عمار بن ياسر (الطيب المطيب)وهو رجل من أهل الجنة ،وُلد عمار بمكة المكرمة سنة570م،وكانوأبوه هو ياسر بن عامر،وأمه سمية بنت خياط،كان ياسر بن عامر والد عمار من اليمن ولكنه ترك وخرج منها ليبحث عن أخيه حتى استقر فى مكة وطاب له المقام بها محالفاً أبا حُذيفة بن المغيرة ،وبنو المغيرة كان لهم شأنٌ رفيع فى مكة،فقام أبو حذيفة بتزويج ياسر بن عامر إحدى إمائه وهى (سمية بنت خياط)ومن هذا الزواج المبارك رُزق الأبوين (عمَّاراً)رضى الله عنه 🤍''',
    },
    {
      'image': 'asset/hager).jpg',
      'i': 'هاجر ',
      'text': '''
كان آل ياسر،عمار وأمه وأبوه من أوائل الذين أسلموا حين بدأ الرسول صلى الله عليه وسلم بنشر دعوته،ولما علم (بنو مخزوم)بإسلامهم قاموا بتعذبيهم أشد العذاب،فقد كانوا يأخدونهم كل يومٍ إلى رمضاء مكة الملتهبة ويصبون عليهم من العذاب صباً،حتى أن أصحاب عمار كانوا يصفون العذاب الذى يقع به قائلين:(كان عمار يُعذب حتى لا يدرى ما يقول) يعنى من شدة العذاب بيفقد وعيه تماماً!!وكانوا يقولون:(أحرق المشركون عمار بن ياسر بالنار،فكان رسول الله صلى الله عليه وسلم يمرُ به،ويُمُّرِ يده على رأسه ويقول:(يا نار كونى برداً وسلاماً على ((عمار))،كما كنتِ برداً وسلاماً على إبراهيم)''',
    },
    {
      'image': 'asset/hager).jpg',
      'i': 'هاجر ',
      'text': '''
وكان رسول الله صلى الله عليه وسلم يمر عليهم وهم يُعذبون،فيقول لهم:(صبراً آل ياسر فإن موعدكم الجنة)🥹يعدهم رسول الله ويخبرهم بأن لهم الجنة،فهل هناك أجمل من هذا الوعد!!؟ولم يكن رسول الله يقوى على الدفاع عنه وعن المسلمين الذين يعذبون ليس عن ضعف منه أو عجز،ولكن كان المسلمون فى ذلك الوقت قليلون فى العدد، وكل أهل مكة يعادون الإسلام،فكان من الخطأ الوقوف بهذا العدد فى وجه أهل مكة جميعهم،خصوصاً أن الإسلام لم يكن قد انتشر أو رحب به أحد،ففكر رسول الله صلى الله عليه وسلم فى حلٍ أفضل ،وهو إيجاد مكان جيد يأوى المسلمين ويقومون فيه بالدعوة إلى دين الله فقاموا بالهجرة الأولى إلى (الحبشة)،وفكر الرسول فى الهجرة ؛وذلك لرفض قريش التام للإسلام ،فكان أسلم حل هو ترك ذاك المكان''',
    },
    {
      'image': 'asset/hager).jpg',
      'i': 'هاجر ',
      'text': '''
كان عمار يُعذب حتى لا يدرى ما يقول ،فقد كانوا يأمرونه بأن يمدح آلهتهم ويذكرها بالخير ويسب الإسلام،وكان عمار يقول ذلك وهو غير مدرك لما يقول،حتى إذا استفاق ندم وبكى ،فمر الرسول به وهو يبكى فأخذ يمسح دموعه بيده الشريفة ويقول له:(أخذك الكفار فغطوك فى الماء،فقلت:كذا...وكذا..؟
أجاب عمار وهو يبكى بشدة:نعم يا رسول الله....
فقال له الرسول:(إن عادوا،فقل لهم مثل قولك هذا)
ثم تلا الآية الكريمة:(إلا من أُكره وقلبه مطمئن للإيمان)
يعنى الرسول بيقوله لو رجعوا وعذبوك قول اللى أنت قولته تانى ومش هيكون عليك ذنب عشان أنت مكره أو مضطر تقول كدا''',
    },
    {
      'image': 'asset/hager).jpg',
      'i': 'هاجر ',
      'text': '''
وبعد هجرة المسلمين إلى المدينة،أخذ عمار مكاناً عالياً بين الصحابة
فقد كان رسول الله صلى الله عليه وسلم يقول عنه:(إن عماراً مُلئ إيماناً إلى مُشاشه)
وحين وقع سوء تفاهم بين خالد بن الوليد وعمار،قال رسول الله:(من عَادَى عماراً،عاداه الله،ومن أبغض عماراً أبغضه الله)فأسرع خالد بن الوليد معتذراً إليه،بس لو ركزت فى الجملة اللى فاتت دى ،يعنى ايه واحد لو أنت عاديته ربنا يعاديك،ياااااه مش متخيله مكانته عند ربنا وحب ربنا له عامل ازاى!!!؟اللهم حباً كحبك لعمار 🥹🥹🤍''',
    },
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      // appBar: AppBar(
      //   title: Text(
      //     'نسيم', style: TextStyle(fontFamily: 'Marhey', fontSize: 35),),
      // ),
      body: GridView.builder(
        gridDelegate:
            SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 1),
        itemBuilder: (context, index) => Column(
          children: [
            InkWell(
              onTap: () {
                Navigator.push(context, MaterialPageRoute(builder: (ontext)=>test(text: image[index]['text'].toString())));
              },
              child: Card(
                child: Container(
                  clipBehavior: Clip.antiAliasWithSaveLayer,
                  decoration:
                      BoxDecoration(borderRadius: BorderRadius.circular(25)),
                  child: Stack(
                    alignment: AlignmentDirectional.center,
                    children: [
                      Image(
                        image: AssetImage('${image[index]['image']}'),
                        width: 252,
                        height: 252,
                        fit: BoxFit.cover,
                      ),
                      Container(

                        width: 248,
                        height: 248,
                        child: Directionality(
                          textDirection: TextDirection.rtl,
                          child: Padding(
                            padding: const EdgeInsets.all(12),
                            child: Text(
                              '${image[index]['text']}',
                              style: Theme.of(context).textTheme.bodyText1?.copyWith( color: Colors.black,
                                  fontSize: 13, overflow: TextOverflow.ellipsis),
                              maxLines: 10,
                            ),
                          ),
                        ),
                      ),
                    ],
                  ),
                ),
              ),
            ),
            Text(
              '${image[index]['i']}',
              style: Theme.of(context).textTheme.bodyText1?.copyWith(
                    fontSize: 28,
                  ),
            )
          ],
        ),
        itemCount: image.length,
      ),
    );
  }
}
